docs/vcs/githubpages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-30 Wed 00:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Github Pages</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Katherine Chuang" />


<link rel="stylesheet" type="text/css" href="assets/style.min.css"/>

</head>
<body>
<div id="content">
<h1 class="title">Github Pages
<br />
<span class="subtitle">Getting started with web development</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4371472">1. What is Github Pages?</a></li>
<li><a href="#org609372b">2. How to make your home page</a></li>
<li><a href="#orgc158dcc">3. Using Jekyll Static Site Generator</a>
<ul>
<li><a href="#org1547481">3.1. Guides to using Jekyll</a></li>
</ul>
</li>
<li><a href="#org08dc673">4. References</a>
<ul>
<li><a href="#org69cb6d3">4.1. Intro to HTML/CSS</a></li>
<li><a href="#orgd2eccbd">4.2. Tutorials and Guides on deploying to GitHub Pages</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org4371472" class="outline-2">
<h2 id="org4371472"><span class="section-number-2">1</span> What is Github Pages?</h2>
</div>

<div id="outline-container-org609372b" class="outline-2">
<h2 id="org609372b"><span class="section-number-2">2</span> How to make your home page</h2>
<div class="outline-text-2" id="text-2">
<p>
When you use GitHub pages, you can access your website at the url <a href="http://username.github.io">http://username.github.io</a> and the underlying files would be found in your repository, which can be found at url pattern ttp://github.com/username/username.github.io
</p>

<p>
This section walks you through step by step.
</p>

<p>
<b>Short version:</b>
</p>
<ol class="org-ol">
<li>Create a repo of name: <b>yourusername</b>.github.io</li>
<li>Go to that repo&rsquo;s settings and check the box for your pages (note the drop down option selected)</li>
<li>Add .html files to your repo</li>
</ol>

<p>
You should be able to access your website from <code>http://yourusername.github.io</code>
</p>

<p>
<b>Longer version:</b>
</p>
<ol class="org-ol">
<li>From your account, create a new repo following the structure username.github.io &#x2013; this is the basis for producing a website hosted by github pages (<a href="https://pages.github.com/">https://pages.github.com/</a>).</li>
<li>Confirm that the pages feature is turned on for that repository, under the settings menu.</li>
<li>This allows you to host files under your GitHub account.
<ol class="org-ol">
<li>You could use the github.com web interface to upload each file individually, however I recommended you take time at some point in your career to gain familiarity with the workflow of using git commands from your machine terminal.</li>
<li>Upload the images and html files to that repo.</li>
</ol></li>
<li>If set up properly you should be able to access your website from <a href="http://username.github.io">http://username.github.io</a></li>
</ol>
</div>
</div>

<div id="outline-container-orgc158dcc" class="outline-2">
<h2 id="orgc158dcc"><span class="section-number-2">3</span> Using Jekyll Static Site Generator</h2>
<div class="outline-text-2" id="text-3">
<p>
Github Pages recognizes files that are formatted to the Jekyll Static Site Generated fraemwork. Jekyll (<a href="https://jekyllrb.com/">https://jekyllrb.com/</a>) is written in the Ruby programming language, it convers text files in markdown format into HTML pages.
</p>

<p>
Static HTML pages means that it&rsquo;s an HTML page that doesn&rsquo;t change when you view it across different timestaps. As in, static is <i>not</i> a script generated page. The contents do not change because you pull data from a database. A page like that would be considered <i>dynamic</i> because the contents can change.
</p>
</div>

<div id="outline-container-org1547481" class="outline-3">
<h3 id="org1547481"><span class="section-number-3">3.1</span> Guides to using Jekyll</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The guides and tutorials for using Jekyll are easily found through your nearest search engine. These are some liks:
</p>
<ul class="org-ul">
<li><a href="https://jekyllrb.com/docs/github-pages/">https://jekyllrb.com/docs/github-pages/</a></li>
<li>Building a static website with Jekyll and GitHub Pages <a href="https://programminghistorian.org/en/lessons/building-static-sites-with-jekyll-github-pages">https://programminghistorian.org/en/lessons/building-static-sites-with-jekyll-github-pages</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org08dc673" class="outline-2">
<h2 id="org08dc673"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org69cb6d3" class="outline-3">
<h3 id="org69cb6d3"><span class="section-number-3">4.1</span> Intro to HTML/CSS</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>HTML Specifications <a href="https://html.spec.whatwg.org/">https://html.spec.whatwg.org/</a></li>
<li>CSS Specifications <a href="https://www.w3.org/Style/CSS/specs.en.html">https://www.w3.org/Style/CSS/specs.en.html</a></li>
<li>Intro to HTML/CSS: Making webpages Khan Academy. <a href="https://www.khanacademy.org/computing/computer-programming/html-css">https://www.khanacademy.org/computing/computer-programming/html-css</a></li>
<li>Starting with HTML + CSS tutorial by W3C</li>
<li>Web Design &amp; Development I <a href="https://www.washington.edu/accessit/webdesign/student/lessons.htm">https://www.washington.edu/accessit/webdesign/student/lessons.htm</a></li>
<li>Codecademy: Introduction to HTML <a href="https://www.codecademy.com/learn/learn-html">https://www.codecademy.com/learn/learn-html</a></li>
<li>Interactive HTML tutorial <a href="https://www.learn-html.org/">https://www.learn-html.org/</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd2eccbd" class="outline-3">
<h3 id="orgd2eccbd"><span class="section-number-3">4.2</span> Tutorials and Guides on deploying to GitHub Pages</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>GitHub’s 10 minute read guide <a href="https://guides.github.com/features/pages/">https://guides.github.com/features/pages/</a></li>
<li>GitHub Pages Basics <a href="https://help.github.com/categories/github-pages-basics/">https://help.github.com/categories/github-pages-basics/</a></li>
<li>Khan Academy’s tutorial <a href="https://www.khanacademy.org/computing/computer-programming/html-css/web-development-tools/a/hosting-your-website-on-github">https://www.khanacademy.org/computing/computer-programming/html-css/web-development-tools/a/hosting-your-website-on-github</a></li>
<li>Thinkful’s tutorial <a href="https://www.thinkful.com/learn/a-guide-to-using-github-pages/">https://www.thinkful.com/learn/a-guide-to-using-github-pages/</a></li>
<li>Build a Web Portfolio from Scratch <a href="https://dannguyen.github.io/github-for-portfolios/">https://dannguyen.github.io/github-for-portfolios/</a></li>
<li>Set Up Your Portfolio Website in Less Than 10 Minutes with Github Pages <a href="https://blog.usejournal.com/set-up-your-portfolio-website-in-less-than-10-minutes-with-github-pages-d0efa8ff56fd">https://blog.usejournal.com/set-up-your-portfolio-website-in-less-than-10-minutes-with-github-pages-d0efa8ff56fd</a></li>
<li>The Beginners Guide to Github Pages <a href="https://www.ostraining.com/blog/coding/github-pages/">https://www.ostraining.com/blog/coding/github-pages/</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Katherine Chuang</p>
<p class="date">Created: 2020-09-30 Wed 00:16</p>
</div>
</body>
</html>
